# HeadHunter API
HH_API_URL = "https://api.hh.ru/vacancies"
HH_AREAS_URL = "https://api.hh.ru/areas"

# SuperJob API
SUPERJOB_API_URL = "https://api.superjob.ru/2.0/vacancies/"
SUPERJOB_API_KEY = "v3.r.139727585.4f9ea9fb1238e927037c0c93d5af0fdde7a62afe.dd5f69132c2bdbc05d8123ab1e162aa2fef2223b"

# Параметры
TIMEOUT = 10
DELAY = 1
MAX_VACANCIES_PER_PROFESSION = 100
MAX_VACANCIES_PER_CITY = 100  # Максимум вакансий на город для SuperJob

PARSE_ALL_RUSSIA = True
AREAS_TO_PARSE = []

# Регионы России
# Основные регионы для SuperJob - своя система ID городов
SUPERJOB_TOWNS = {
    "Москва": 4,
    "Санкт-Петербург": 5,
    "Екатеринбург": 66,
    "Новосибирск": 70,
    "Казань": 88,
    "Нижний Новгород": 61,
    "Самара": 78,
    "Омск": 69,
    "Челябинск": 92,
    "Ростов-на-Дону": 76,
    "Уфа": 85,
    "Красноярск": 58,
    "Пермь": 72,
    "Воронеж": 30,
    "Волгоград": 29,
    "Краснодар": 56,
    "Саратов": 79,
    "Тюмень": 83,
    "Тольятти": 82,
    "Ижевск": 43,
    "Барнаул": 20,
    "Ульяновск": 84,
    "Иркутск": 44,
    "Хабаровск": 87,
    "Ярославль": 96,
    "Владивосток": 28,
    "Махачкала": 60,
    "Томск": 81,
    "Оренбург": 68,
    "Кемерово": 50,
    "Новокузнецк": 71,
    "Рязань": 77,
    "Астрахань": 19,
    "Пенза": 73,
    "Липецк": 59,
    "Киров": 52,
    "Чебоксары": 91,
    "Калининград": 49,
    "Брянск": 24,
    "Курск": 57,
    "Иваново": 42,
    "Магнитогорск": 89,
    "Тверь": 80,
    "Ставрополь": 89,
    "Белгород": 22,
    "Сочи": 89,
    "Нижний Тагил": 61
}